SiliconLabs/sdk_support/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_rac.h
/* Bit fields for RAC SEQCTRL */
#define _RAC_SEQCTRL_RESETVALUE                                       0x00000000UL                                      /**< Default value for RAC_SEQCTRL               */
#define _RAC_SEQCTRL_MASK                                             0x00001C07UL                                      /**< Mask for RAC_SEQCTRL                        */
#define RAC_SEQCTRL_COMPACT                                           (0x1UL << 0)                                      /**< STIMER Compare Action                       */
#define _RAC_SEQCTRL_COMPACT_SHIFT                                    0                                                 /**< Shift value for RAC_COMPACT                 */
#define _RAC_SEQCTRL_COMPACT_MASK                                     0x1UL                                             /**< Bit mask for RAC_COMPACT                    */
#define _RAC_SEQCTRL_COMPACT_DEFAULT                                  0x00000000UL                                      /**< Mode DEFAULT for RAC_SEQCTRL                */
#define _RAC_SEQCTRL_COMPACT_WRAP                                     0x00000000UL                                      /**< Mode WRAP for RAC_SEQCTRL                   */
#define _RAC_SEQCTRL_COMPACT_CONTINUE                                 0x00000001UL                                      /**< Mode CONTINUE for RAC_SEQCTRL               */
#define RAC_SEQCTRL_COMPACT_DEFAULT                                   (_RAC_SEQCTRL_COMPACT_DEFAULT << 0)               /**< Shifted mode DEFAULT for RAC_SEQCTRL        */
#define RAC_SEQCTRL_COMPACT_WRAP                                      (_RAC_SEQCTRL_COMPACT_WRAP << 0)                  /**< Shifted mode WRAP for RAC_SEQCTRL           */
#define RAC_SEQCTRL_COMPACT_CONTINUE                                  (_RAC_SEQCTRL_COMPACT_CONTINUE << 0)              /**< Shifted mode CONTINUE for RAC_SEQCTRL       */
#define _RAC_SEQCTRL_COMPINVALMODE_SHIFT                              1                                                 /**< Shift value for RAC_COMPINVALMODE           */
#define _RAC_SEQCTRL_COMPINVALMODE_MASK                               0x6UL                                             /**< Bit mask for RAC_COMPINVALMODE              */
#define _RAC_SEQCTRL_COMPINVALMODE_DEFAULT                            0x00000000UL                                      /**< Mode DEFAULT for RAC_SEQCTRL                */
#define _RAC_SEQCTRL_COMPINVALMODE_NEVER                              0x00000000UL                                      /**< Mode NEVER for RAC_SEQCTRL                  */
#define _RAC_SEQCTRL_COMPINVALMODE_STATECHANGE                        0x00000001UL                                      /**< Mode STATECHANGE for RAC_SEQCTRL            */
#define _RAC_SEQCTRL_COMPINVALMODE_COMPEVENT                          0x00000002UL                                      /**< Mode COMPEVENT for RAC_SEQCTRL              */
#define _RAC_SEQCTRL_COMPINVALMODE_STATECOMP                          0x00000003UL                                      /**< Mode STATECOMP for RAC_SEQCTRL              */
#define RAC_SEQCTRL_COMPINVALMODE_DEFAULT                             (_RAC_SEQCTRL_COMPINVALMODE_DEFAULT << 1)         /**< Shifted mode DEFAULT for RAC_SEQCTRL        */
#define RAC_SEQCTRL_COMPINVALMODE_NEVER                               (_RAC_SEQCTRL_COMPINVALMODE_NEVER << 1)           /**< Shifted mode NEVER for RAC_SEQCTRL          */
#define RAC_SEQCTRL_COMPINVALMODE_STATECHANGE                         (_RAC_SEQCTRL_COMPINVALMODE_STATECHANGE << 1)     /**< Shifted mode STATECHANGE for RAC_SEQCTRL    */
#define RAC_SEQCTRL_COMPINVALMODE_COMPEVENT                           (_RAC_SEQCTRL_COMPINVALMODE_COMPEVENT << 1)       /**< Shifted mode COMPEVENT for RAC_SEQCTRL      */
#define RAC_SEQCTRL_COMPINVALMODE_STATECOMP                           (_RAC_SEQCTRL_COMPINVALMODE_STATECOMP << 1)       /**< Shifted mode STATECOMP for RAC_SEQCTRL      */
#define RAC_SEQCTRL_STIMERDEBUGRUN                                    (0x1UL << 10)                                     /**< STIMER Debug Run                            */
#define _RAC_SEQCTRL_STIMERDEBUGRUN_SHIFT                             10                                                /**< Shift value for RAC_STIMERDEBUGRUN          */
#define _RAC_SEQCTRL_STIMERDEBUGRUN_MASK                              0x400UL                                           /**< Bit mask for RAC_STIMERDEBUGRUN             */
#define _RAC_SEQCTRL_STIMERDEBUGRUN_DEFAULT                           0x00000000UL                                      /**< Mode DEFAULT for RAC_SEQCTRL                */
#define _RAC_SEQCTRL_STIMERDEBUGRUN_X0                                0x00000000UL                                      /**< Mode X0 for RAC_SEQCTRL                     */
#define _RAC_SEQCTRL_STIMERDEBUGRUN_X1                                0x00000001UL                                      /**< Mode X1 for RAC_SEQCTRL                     */
#define RAC_SEQCTRL_STIMERDEBUGRUN_DEFAULT                            (_RAC_SEQCTRL_STIMERDEBUGRUN_DEFAULT << 10)       /**< Shifted mode DEFAULT for RAC_SEQCTRL        */
#define RAC_SEQCTRL_STIMERDEBUGRUN_X0                                 (_RAC_SEQCTRL_STIMERDEBUGRUN_X0 << 10)            /**< Shifted mode X0 for RAC_SEQCTRL             */
#define RAC_SEQCTRL_STIMERDEBUGRUN_X1                                 (_RAC_SEQCTRL_STIMERDEBUGRUN_X1 << 10)            /**< Shifted mode X1 for RAC_SEQCTRL             */
#define RAC_SEQCTRL_CPUHALTREQEN                                      (0x1UL << 11)                                     /**< CPU Halt Request Enable                     */
#define _RAC_SEQCTRL_CPUHALTREQEN_SHIFT                               11                                                /**< Shift value for RAC_CPUHALTREQEN            */
#define _RAC_SEQCTRL_CPUHALTREQEN_MASK                                0x800UL                                           /**< Bit mask for RAC_CPUHALTREQEN               */
#define _RAC_SEQCTRL_CPUHALTREQEN_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for RAC_SEQCTRL                */
#define _RAC_SEQCTRL_CPUHALTREQEN_X0                                  0x00000000UL                                      /**< Mode X0 for RAC_SEQCTRL                     */
#define _RAC_SEQCTRL_CPUHALTREQEN_X1                                  0x00000001UL                                      /**< Mode X1 for RAC_SEQCTRL                     */
#define RAC_SEQCTRL_CPUHALTREQEN_DEFAULT                              (_RAC_SEQCTRL_CPUHALTREQEN_DEFAULT << 11)         /**< Shifted mode DEFAULT for RAC_SEQCTRL        */
#define RAC_SEQCTRL_CPUHALTREQEN_X0                                   (_RAC_SEQCTRL_CPUHALTREQEN_X0 << 11)              /**< Shifted mode X0 for RAC_SEQCTRL             */
#define RAC_SEQCTRL_CPUHALTREQEN_X1                                   (_RAC_SEQCTRL_CPUHALTREQEN_X1 << 11)              /**< Shifted mode X1 for RAC_SEQCTRL             */
#define RAC_SEQCTRL_SEQHALTUPONCPUHALTEN                              (0x1UL << 12)                                     /**< Sequencer Halt Upon CPU Halt Enable         */
#define _RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_SHIFT                       12                                                /**< Shift value for RAC_SEQHALTUPONCPUHALTEN    */
#define _RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_MASK                        0x1000UL                                          /**< Bit mask for RAC_SEQHALTUPONCPUHALTEN       */
#define _RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for RAC_SEQCTRL                */
#define _RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_X0                          0x00000000UL                                      /**< Mode X0 for RAC_SEQCTRL                     */
#define _RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_X1                          0x00000001UL                                      /**< Mode X1 for RAC_SEQCTRL                     */
#define RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_DEFAULT                      (_RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_DEFAULT << 12) /**< Shifted mode DEFAULT for RAC_SEQCTRL        */
#define RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_X0                           (_RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_X0 << 12)      /**< Shifted mode X0 for RAC_SEQCTRL             */
#define RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_X1                           (_RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_X1 << 12)      /**< Shifted mode X1 for RAC_SEQCTRL             */

/* Bit fields for RAC PRESC */
#define _RAC_PRESC_RESETVALUE                                         0x00000007UL                     /**< Default value for RAC_PRESC                 */
#define _RAC_PRESC_MASK                                               0x0000007FUL                     /**< Mask for RAC_PRESC                          */
#define _RAC_PRESC_STIMER_SHIFT                                       0                                /**< Shift value for RAC_STIMER                  */
#define _RAC_PRESC_STIMER_MASK                                        0x7FUL                           /**< Bit mask for RAC_STIMER                     */
#define _RAC_PRESC_STIMER_DEFAULT                                     0x00000007UL                     /**< Mode DEFAULT for RAC_PRESC                  */
#define RAC_PRESC_STIMER_DEFAULT                                      (_RAC_PRESC_STIMER_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_PRESC          */

