SiliconLabs/sdk_support/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_rac.h
/* Bit fields for RAC CLKMULTSTATUS */
#define _RAC_CLKMULTSTATUS_RESETVALUE                                 0x00000000UL                                       /**< Default value for RAC_CLKMULTSTATUS         */
#define _RAC_CLKMULTSTATUS_MASK                                       0x0000001FUL                                       /**< Mask for RAC_CLKMULTSTATUS                  */
#define _RAC_CLKMULTSTATUS_CLKMULTOUTNIBBLE_SHIFT                     0                                                  /**< Shift value for RAC_CLKMULTOUTNIBBLE        */
#define _RAC_CLKMULTSTATUS_CLKMULTOUTNIBBLE_MASK                      0xFUL                                              /**< Bit mask for RAC_CLKMULTOUTNIBBLE           */
#define _RAC_CLKMULTSTATUS_CLKMULTOUTNIBBLE_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for RAC_CLKMULTSTATUS          */
#define RAC_CLKMULTSTATUS_CLKMULTOUTNIBBLE_DEFAULT                    (_RAC_CLKMULTSTATUS_CLKMULTOUTNIBBLE_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_CLKMULTSTATUS  */
#define RAC_CLKMULTSTATUS_CLKMULTACKVALID                             (0x1UL << 4)                                       /**< CLKMULTACKVALID                             */
#define _RAC_CLKMULTSTATUS_CLKMULTACKVALID_SHIFT                      4                                                  /**< Shift value for RAC_CLKMULTACKVALID         */
#define _RAC_CLKMULTSTATUS_CLKMULTACKVALID_MASK                       0x10UL                                             /**< Bit mask for RAC_CLKMULTACKVALID            */
#define _RAC_CLKMULTSTATUS_CLKMULTACKVALID_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_CLKMULTSTATUS          */
#define _RAC_CLKMULTSTATUS_CLKMULTACKVALID_invalid                    0x00000000UL                                       /**< Mode invalid for RAC_CLKMULTSTATUS          */
#define _RAC_CLKMULTSTATUS_CLKMULTACKVALID_valid                      0x00000001UL                                       /**< Mode valid for RAC_CLKMULTSTATUS            */
#define RAC_CLKMULTSTATUS_CLKMULTACKVALID_DEFAULT                     (_RAC_CLKMULTSTATUS_CLKMULTACKVALID_DEFAULT << 4)  /**< Shifted mode DEFAULT for RAC_CLKMULTSTATUS  */
#define RAC_CLKMULTSTATUS_CLKMULTACKVALID_invalid                     (_RAC_CLKMULTSTATUS_CLKMULTACKVALID_invalid << 4)  /**< Shifted mode invalid for RAC_CLKMULTSTATUS  */
#define RAC_CLKMULTSTATUS_CLKMULTACKVALID_valid                       (_RAC_CLKMULTSTATUS_CLKMULTACKVALID_valid << 4)    /**< Shifted mode valid for RAC_CLKMULTSTATUS    */

/* Bit fields for RAC IFADCTRIM */
#define _RAC_IFADCTRIM_RESETVALUE                                     0x08965290UL                                                /**< Default value for RAC_IFADCTRIM             */
#define _RAC_IFADCTRIM_MASK                                           0x0FFFFFFFUL                                                /**< Mask for RAC_IFADCTRIM                      */
#define RAC_IFADCTRIM_IFADCCLKSEL                                     (0x1UL << 0)                                                /**< IFADCCLKSEL                                 */
#define _RAC_IFADCTRIM_IFADCCLKSEL_SHIFT                              0                                                           /**< Shift value for RAC_IFADCCLKSEL             */
#define _RAC_IFADCTRIM_IFADCCLKSEL_MASK                               0x1UL                                                       /**< Bit mask for RAC_IFADCCLKSEL                */
#define _RAC_IFADCTRIM_IFADCCLKSEL_DEFAULT                            0x00000000UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCCLKSEL_clk_2p4g                           0x00000000UL                                                /**< Mode clk_2p4g for RAC_IFADCTRIM             */
#define _RAC_IFADCTRIM_IFADCCLKSEL_clk_subg                           0x00000001UL                                                /**< Mode clk_subg for RAC_IFADCTRIM             */
#define RAC_IFADCTRIM_IFADCCLKSEL_DEFAULT                             (_RAC_IFADCTRIM_IFADCCLKSEL_DEFAULT << 0)                   /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCCLKSEL_clk_2p4g                            (_RAC_IFADCTRIM_IFADCCLKSEL_clk_2p4g << 0)                  /**< Shifted mode clk_2p4g for RAC_IFADCTRIM     */
#define RAC_IFADCTRIM_IFADCCLKSEL_clk_subg                            (_RAC_IFADCTRIM_IFADCCLKSEL_clk_subg << 0)                  /**< Shifted mode clk_subg for RAC_IFADCTRIM     */
#define RAC_IFADCTRIM_IFADCENHALFMODE                                 (0x1UL << 1)                                                /**< IFADCENHALFMODE                             */
#define _RAC_IFADCTRIM_IFADCENHALFMODE_SHIFT                          1                                                           /**< Shift value for RAC_IFADCENHALFMODE         */
#define _RAC_IFADCTRIM_IFADCENHALFMODE_MASK                           0x2UL                                                       /**< Bit mask for RAC_IFADCENHALFMODE            */
#define _RAC_IFADCTRIM_IFADCENHALFMODE_DEFAULT                        0x00000000UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCENHALFMODE_full_speed_mode                0x00000000UL                                                /**< Mode full_speed_mode for RAC_IFADCTRIM      */
#define _RAC_IFADCTRIM_IFADCENHALFMODE_half_speed_mode                0x00000001UL                                                /**< Mode half_speed_mode for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCENHALFMODE_DEFAULT                         (_RAC_IFADCTRIM_IFADCENHALFMODE_DEFAULT << 1)               /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCENHALFMODE_full_speed_mode                 (_RAC_IFADCTRIM_IFADCENHALFMODE_full_speed_mode << 1)       /**< Shifted mode full_speed_mode for RAC_IFADCTRIM*/
#define RAC_IFADCTRIM_IFADCENHALFMODE_half_speed_mode                 (_RAC_IFADCTRIM_IFADCENHALFMODE_half_speed_mode << 1)       /**< Shifted mode half_speed_mode for RAC_IFADCTRIM*/
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_SHIFT                     2                                                           /**< Shift value for RAC_IFADCLDOSERIESAMPLVL    */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_MASK                      0x1CUL                                                      /**< Bit mask for RAC_IFADCLDOSERIESAMPLVL       */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_DEFAULT                   0x00000004UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p20                     0x00000000UL                                                /**< Mode v1p20 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p24                     0x00000001UL                                                /**< Mode v1p24 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p28                     0x00000002UL                                                /**< Mode v1p28 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p32                     0x00000003UL                                                /**< Mode v1p32 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p35                     0x00000004UL                                                /**< Mode v1p35 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p39                     0x00000005UL                                                /**< Mode v1p39 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p42                     0x00000006UL                                                /**< Mode v1p42 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p46                     0x00000007UL                                                /**< Mode v1p46 for RAC_IFADCTRIM                */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_DEFAULT                    (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_DEFAULT << 2)          /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p20                      (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p20 << 2)            /**< Shifted mode v1p20 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p24                      (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p24 << 2)            /**< Shifted mode v1p24 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p28                      (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p28 << 2)            /**< Shifted mode v1p28 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p32                      (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p32 << 2)            /**< Shifted mode v1p32 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p35                      (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p35 << 2)            /**< Shifted mode v1p35 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p39                      (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p39 << 2)            /**< Shifted mode v1p39 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p42                      (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p42 << 2)            /**< Shifted mode v1p42 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p46                      (_RAC_IFADCTRIM_IFADCLDOSERIESAMPLVL_v1p46 << 2)            /**< Shifted mode v1p46 for RAC_IFADCTRIM        */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_SHIFT                      5                                                           /**< Shift value for RAC_IFADCLDOSHUNTAMPLVL     */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_MASK                       0xE0UL                                                      /**< Bit mask for RAC_IFADCLDOSHUNTAMPLVL        */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_DEFAULT                    0x00000004UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p20                      0x00000000UL                                                /**< Mode v1p20 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p24                      0x00000001UL                                                /**< Mode v1p24 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p28                      0x00000002UL                                                /**< Mode v1p28 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p32                      0x00000003UL                                                /**< Mode v1p32 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p35                      0x00000004UL                                                /**< Mode v1p35 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p39                      0x00000005UL                                                /**< Mode v1p39 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p42                      0x00000006UL                                                /**< Mode v1p42 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p46                      0x00000007UL                                                /**< Mode v1p46 for RAC_IFADCTRIM                */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_DEFAULT                     (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_DEFAULT << 5)           /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p20                       (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p20 << 5)             /**< Shifted mode v1p20 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p24                       (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p24 << 5)             /**< Shifted mode v1p24 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p28                       (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p28 << 5)             /**< Shifted mode v1p28 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p32                       (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p32 << 5)             /**< Shifted mode v1p32 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p35                       (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p35 << 5)             /**< Shifted mode v1p35 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p39                       (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p39 << 5)             /**< Shifted mode v1p39 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p42                       (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p42 << 5)             /**< Shifted mode v1p42 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p46                       (_RAC_IFADCTRIM_IFADCLDOSHUNTAMPLVL_v1p46 << 5)             /**< Shifted mode v1p46 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLP                              (0x1UL << 8)                                                /**< IFADCLDOSHUNTCURLP                          */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_SHIFT                       8                                                           /**< Shift value for RAC_IFADCLDOSHUNTCURLP      */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_MASK                        0x100UL                                                     /**< Bit mask for RAC_IFADCLDOSHUNTCURLP         */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_DEFAULT                     0x00000000UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_low_power_disabled          0x00000000UL                                                /**< Mode low_power_disabled for RAC_IFADCTRIM   */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_low_power_enabled           0x00000001UL                                                /**< Mode low_power_enabled for RAC_IFADCTRIM    */
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_DEFAULT                      (_RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_DEFAULT << 8)            /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_low_power_disabled           (_RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_low_power_disabled << 8) /**< Shifted mode low_power_disabled for RAC_IFADCTRIM*/
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_low_power_enabled            (_RAC_IFADCTRIM_IFADCLDOSHUNTCURLP_low_power_enabled << 8)  /**< Shifted mode low_power_enabled for RAC_IFADCTRIM*/
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_SHIFT                      9                                                           /**< Shift value for RAC_IFADCLDOSHUNTCURLVL     */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_MASK                       0x600UL                                                     /**< Bit mask for RAC_IFADCLDOSHUNTCURLVL        */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_DEFAULT                    0x00000001UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_180uA              0x00000000UL                                                /**< Mode current_180uA for RAC_IFADCTRIM        */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_190uA              0x00000001UL                                                /**< Mode current_190uA for RAC_IFADCTRIM        */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_200uA              0x00000002UL                                                /**< Mode current_200uA for RAC_IFADCTRIM        */
#define _RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_210uA              0x00000003UL                                                /**< Mode current_210uA for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_DEFAULT                     (_RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_DEFAULT << 9)           /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_180uA               (_RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_180uA << 9)     /**< Shifted mode current_180uA for RAC_IFADCTRIM*/
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_190uA               (_RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_190uA << 9)     /**< Shifted mode current_190uA for RAC_IFADCTRIM*/
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_200uA               (_RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_200uA << 9)     /**< Shifted mode current_200uA for RAC_IFADCTRIM*/
#define RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_210uA               (_RAC_IFADCTRIM_IFADCLDOSHUNTCURLVL_current_210uA << 9)     /**< Shifted mode current_210uA for RAC_IFADCTRIM*/
#define _RAC_IFADCTRIM_IFADCOTAST1CURRENT_SHIFT                       11                                                          /**< Shift value for RAC_IFADCOTAST1CURRENT      */
#define _RAC_IFADCTRIM_IFADCOTAST1CURRENT_MASK                        0x1800UL                                                    /**< Bit mask for RAC_IFADCOTAST1CURRENT         */
#define _RAC_IFADCTRIM_IFADCOTAST1CURRENT_DEFAULT                     0x00000002UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCOTAST1CURRENT_negative_20p                0x00000000UL                                                /**< Mode negative_20p for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCOTAST1CURRENT_negative_11p                0x00000001UL                                                /**< Mode negative_11p for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCOTAST1CURRENT_nominal                     0x00000002UL                                                /**< Mode nominal for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCOTAST1CURRENT_positive_15p                0x00000003UL                                                /**< Mode positive_15p for RAC_IFADCTRIM         */
#define RAC_IFADCTRIM_IFADCOTAST1CURRENT_DEFAULT                      (_RAC_IFADCTRIM_IFADCOTAST1CURRENT_DEFAULT << 11)           /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCOTAST1CURRENT_negative_20p                 (_RAC_IFADCTRIM_IFADCOTAST1CURRENT_negative_20p << 11)      /**< Shifted mode negative_20p for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCOTAST1CURRENT_negative_11p                 (_RAC_IFADCTRIM_IFADCOTAST1CURRENT_negative_11p << 11)      /**< Shifted mode negative_11p for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCOTAST1CURRENT_nominal                      (_RAC_IFADCTRIM_IFADCOTAST1CURRENT_nominal << 11)           /**< Shifted mode nominal for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCOTAST1CURRENT_positive_15p                 (_RAC_IFADCTRIM_IFADCOTAST1CURRENT_positive_15p << 11)      /**< Shifted mode positive_15p for RAC_IFADCTRIM */
#define _RAC_IFADCTRIM_IFADCOTAST2CURRENT_SHIFT                       13                                                          /**< Shift value for RAC_IFADCOTAST2CURRENT      */
#define _RAC_IFADCTRIM_IFADCOTAST2CURRENT_MASK                        0x6000UL                                                    /**< Bit mask for RAC_IFADCOTAST2CURRENT         */
#define _RAC_IFADCTRIM_IFADCOTAST2CURRENT_DEFAULT                     0x00000002UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCOTAST2CURRENT_negative_20p                0x00000000UL                                                /**< Mode negative_20p for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCOTAST2CURRENT_negative_11p                0x00000001UL                                                /**< Mode negative_11p for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCOTAST2CURRENT_nominal                     0x00000002UL                                                /**< Mode nominal for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCOTAST2CURRENT_positive_15p                0x00000003UL                                                /**< Mode positive_15p for RAC_IFADCTRIM         */
#define RAC_IFADCTRIM_IFADCOTAST2CURRENT_DEFAULT                      (_RAC_IFADCTRIM_IFADCOTAST2CURRENT_DEFAULT << 13)           /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCOTAST2CURRENT_negative_20p                 (_RAC_IFADCTRIM_IFADCOTAST2CURRENT_negative_20p << 13)      /**< Shifted mode negative_20p for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCOTAST2CURRENT_negative_11p                 (_RAC_IFADCTRIM_IFADCOTAST2CURRENT_negative_11p << 13)      /**< Shifted mode negative_11p for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCOTAST2CURRENT_nominal                      (_RAC_IFADCTRIM_IFADCOTAST2CURRENT_nominal << 13)           /**< Shifted mode nominal for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCOTAST2CURRENT_positive_15p                 (_RAC_IFADCTRIM_IFADCOTAST2CURRENT_positive_15p << 13)      /**< Shifted mode positive_15p for RAC_IFADCTRIM */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_SHIFT                        15                                                          /**< Shift value for RAC_IFADCREFBUFAMPLVL       */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_MASK                         0x38000UL                                                   /**< Bit mask for RAC_IFADCREFBUFAMPLVL          */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_DEFAULT                      0x00000004UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p88                        0x00000000UL                                                /**< Mode v0p88 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p91                        0x00000001UL                                                /**< Mode v0p91 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p94                        0x00000002UL                                                /**< Mode v0p94 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p97                        0x00000003UL                                                /**< Mode v0p97 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p00                        0x00000004UL                                                /**< Mode v1p00 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p03                        0x00000005UL                                                /**< Mode v1p03 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p06                        0x00000006UL                                                /**< Mode v1p06 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p09                        0x00000007UL                                                /**< Mode v1p09 for RAC_IFADCTRIM                */
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_DEFAULT                       (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_DEFAULT << 15)            /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
