SiliconLabs/sdk_support/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_rac.h
/* Bit fields for RAC LNAMIXTRIM2 */
#define _RAC_LNAMIXTRIM2_RESETVALUE                                   0x00011508UL                                      /**< Default value for RAC_LNAMIXTRIM2           */
#define _RAC_LNAMIXTRIM2_MASK                                         0x0001FFFFUL                                      /**< Mask for RAC_LNAMIXTRIM2                    */
#define _RAC_LNAMIXTRIM2_LNAMIXIBIAS2ADJ_SHIFT                        0                                                 /**< Shift value for RAC_LNAMIXIBIAS2ADJ         */
#define _RAC_LNAMIXTRIM2_LNAMIXIBIAS2ADJ_MASK                         0xFUL                                             /**< Bit mask for RAC_LNAMIXIBIAS2ADJ            */
#define _RAC_LNAMIXTRIM2_LNAMIXIBIAS2ADJ_DEFAULT                      0x00000008UL                                      /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define RAC_LNAMIXTRIM2_LNAMIXIBIAS2ADJ_DEFAULT                       (_RAC_LNAMIXTRIM2_LNAMIXIBIAS2ADJ_DEFAULT << 0)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define _RAC_LNAMIXTRIM2_LNAMIXLNA2CAPSEL_SHIFT                       4                                                 /**< Shift value for RAC_LNAMIXLNA2CAPSEL        */
#define _RAC_LNAMIXTRIM2_LNAMIXLNA2CAPSEL_MASK                        0x70UL                                            /**< Bit mask for RAC_LNAMIXLNA2CAPSEL           */
#define _RAC_LNAMIXTRIM2_LNAMIXLNA2CAPSEL_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define RAC_LNAMIXTRIM2_LNAMIXLNA2CAPSEL_DEFAULT                      (_RAC_LNAMIXTRIM2_LNAMIXLNA2CAPSEL_DEFAULT << 4)  /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define _RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_SHIFT                         7                                                 /**< Shift value for RAC_LNAMIXMXRBIAS2          */
#define _RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_MASK                          0x180UL                                           /**< Bit mask for RAC_LNAMIXMXRBIAS2             */
#define _RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_DEFAULT                       0x00000002UL                                      /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define _RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_1V                       0x00000000UL                                      /**< Mode bias_1V for RAC_LNAMIXTRIM2            */
#define _RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_unused                        0x00000001UL                                      /**< Mode unused for RAC_LNAMIXTRIM2             */
#define _RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_900m                     0x00000002UL                                      /**< Mode bias_900m for RAC_LNAMIXTRIM2          */
#define _RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_800m                     0x00000003UL                                      /**< Mode bias_800m for RAC_LNAMIXTRIM2          */
#define RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_DEFAULT                        (_RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_DEFAULT << 7)    /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_1V                        (_RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_1V << 7)    /**< Shifted mode bias_1V for RAC_LNAMIXTRIM2    */
#define RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_unused                         (_RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_unused << 7)     /**< Shifted mode unused for RAC_LNAMIXTRIM2     */
#define RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_900m                      (_RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_900m << 7)  /**< Shifted mode bias_900m for RAC_LNAMIXTRIM2  */
#define RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_800m                      (_RAC_LNAMIXTRIM2_LNAMIXMXRBIAS2_bias_800m << 7)  /**< Shifted mode bias_800m for RAC_LNAMIXTRIM2  */
#define _RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_SHIFT                         9                                                 /**< Shift value for RAC_LNAMIXNCAS2ADJ          */
#define _RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_MASK                          0x600UL                                           /**< Bit mask for RAC_LNAMIXNCAS2ADJ             */
#define _RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_DEFAULT                       0x00000002UL                                      /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define _RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_1V                       0x00000000UL                                      /**< Mode ncas_1V for RAC_LNAMIXTRIM2            */
#define _RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_unused                        0x00000001UL                                      /**< Mode unused for RAC_LNAMIXTRIM2             */
#define _RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_950m                     0x00000002UL                                      /**< Mode ncas_950m for RAC_LNAMIXTRIM2          */
#define _RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_900m                     0x00000003UL                                      /**< Mode ncas_900m for RAC_LNAMIXTRIM2          */
#define RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_DEFAULT                        (_RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_DEFAULT << 9)    /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_1V                        (_RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_1V << 9)    /**< Shifted mode ncas_1V for RAC_LNAMIXTRIM2    */
#define RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_unused                         (_RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_unused << 9)     /**< Shifted mode unused for RAC_LNAMIXTRIM2     */
#define RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_950m                      (_RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_950m << 9)  /**< Shifted mode ncas_950m for RAC_LNAMIXTRIM2  */
#define RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_900m                      (_RAC_LNAMIXTRIM2_LNAMIXNCAS2ADJ_ncas_900m << 9)  /**< Shifted mode ncas_900m for RAC_LNAMIXTRIM2  */
#define _RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_SHIFT                         11                                                /**< Shift value for RAC_LNAMIXPCAS2ADJ          */
#define _RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_MASK                          0x1800UL                                          /**< Bit mask for RAC_LNAMIXPCAS2ADJ             */
#define _RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_DEFAULT                       0x00000002UL                                      /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define _RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_250m                     0x00000000UL                                      /**< Mode pcas_250m for RAC_LNAMIXTRIM2          */
#define _RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_unused                        0x00000001UL                                      /**< Mode unused for RAC_LNAMIXTRIM2             */
#define _RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_300m                     0x00000002UL                                      /**< Mode pcas_300m for RAC_LNAMIXTRIM2          */
#define _RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_350m                     0x00000003UL                                      /**< Mode pcas_350m for RAC_LNAMIXTRIM2          */
#define RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_DEFAULT                        (_RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_DEFAULT << 11)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */
#define RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_250m                      (_RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_250m << 11) /**< Shifted mode pcas_250m for RAC_LNAMIXTRIM2  */
#define RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_unused                         (_RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_unused << 11)    /**< Shifted mode unused for RAC_LNAMIXTRIM2     */
#define RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_300m                      (_RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_300m << 11) /**< Shifted mode pcas_300m for RAC_LNAMIXTRIM2  */
#define RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_350m                      (_RAC_LNAMIXTRIM2_LNAMIXPCAS2ADJ_pcas_350m << 11) /**< Shifted mode pcas_350m for RAC_LNAMIXTRIM2  */
#define _RAC_LNAMIXTRIM2_LNAMIXVOUT2ADJ_SHIFT                         13                                                /**< Shift value for RAC_LNAMIXVOUT2ADJ          */
#define _RAC_LNAMIXTRIM2_LNAMIXVOUT2ADJ_MASK                          0x1E000UL                                         /**< Bit mask for RAC_LNAMIXVOUT2ADJ             */
#define _RAC_LNAMIXTRIM2_LNAMIXVOUT2ADJ_DEFAULT                       0x00000008UL                                      /**< Mode DEFAULT for RAC_LNAMIXTRIM2            */
#define RAC_LNAMIXTRIM2_LNAMIXVOUT2ADJ_DEFAULT                        (_RAC_LNAMIXTRIM2_LNAMIXVOUT2ADJ_DEFAULT << 13)   /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM2    */

/* Bit fields for RAC LNAMIXCAL */
#define _RAC_LNAMIXCAL_RESETVALUE                                     0x000003F0UL                                      /**< Default value for RAC_LNAMIXCAL             */
#define _RAC_LNAMIXCAL_MASK                                           0x000003FFUL                                      /**< Mask for RAC_LNAMIXCAL                      */
#define RAC_LNAMIXCAL_LNAMIXCALEN                                     (0x1UL << 0)                                      /**< LNAMIXCALEN                                 */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_SHIFT                              0                                                 /**< Shift value for RAC_LNAMIXCALEN             */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_MASK                               0x1UL                                             /**< Bit mask for RAC_LNAMIXCALEN                */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_DEFAULT                            0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_cal_disable                        0x00000000UL                                      /**< Mode cal_disable for RAC_LNAMIXCAL          */
#define _RAC_LNAMIXCAL_LNAMIXCALEN_cal_enable                         0x00000001UL                                      /**< Mode cal_enable for RAC_LNAMIXCAL           */
#define RAC_LNAMIXCAL_LNAMIXCALEN_DEFAULT                             (_RAC_LNAMIXCAL_LNAMIXCALEN_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXCALEN_cal_disable                         (_RAC_LNAMIXCAL_LNAMIXCALEN_cal_disable << 0)     /**< Shifted mode cal_disable for RAC_LNAMIXCAL  */
#define RAC_LNAMIXCAL_LNAMIXCALEN_cal_enable                          (_RAC_LNAMIXCAL_LNAMIXCALEN_cal_enable << 0)      /**< Shifted mode cal_enable for RAC_LNAMIXCAL   */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE                                  (0x1UL << 1)                                      /**< LNAMIXCALVMODE                              */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_SHIFT                           1                                                 /**< Shift value for RAC_LNAMIXCALVMODE          */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_MASK                            0x2UL                                             /**< Bit mask for RAC_LNAMIXCALVMODE             */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode                    0x00000000UL                                      /**< Mode current_mode for RAC_LNAMIXCAL         */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode                    0x00000001UL                                      /**< Mode voltage_mode for RAC_LNAMIXCAL         */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT                          (_RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT << 1)      /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode                     (_RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode << 1) /**< Shifted mode current_mode for RAC_LNAMIXCAL */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode                     (_RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode << 1) /**< Shifted mode voltage_mode for RAC_LNAMIXCAL */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL1                                  (0x1UL << 2)                                      /**< LNAMIXENIRCAL1                              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_SHIFT                           2                                                 /**< Shift value for RAC_LNAMIXENIRCAL1          */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_MASK                            0x4UL                                             /**< Bit mask for RAC_LNAMIXENIRCAL1             */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_disable                         0x00000000UL                                      /**< Mode disable for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_enable                          0x00000001UL                                      /**< Mode enable for RAC_LNAMIXCAL               */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL1_DEFAULT                          (_RAC_LNAMIXCAL_LNAMIXENIRCAL1_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL1_disable                          (_RAC_LNAMIXCAL_LNAMIXENIRCAL1_disable << 2)      /**< Shifted mode disable for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL1_enable                           (_RAC_LNAMIXCAL_LNAMIXENIRCAL1_enable << 2)       /**< Shifted mode enable for RAC_LNAMIXCAL       */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL2                                  (0x1UL << 3)                                      /**< LNAMIXENIRCAL2                              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL2_SHIFT                           3                                                 /**< Shift value for RAC_LNAMIXENIRCAL2          */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL2_MASK                            0x8UL                                             /**< Bit mask for RAC_LNAMIXENIRCAL2             */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL2_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL2_disable                         0x00000000UL                                      /**< Mode disable for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL2_enable                          0x00000001UL                                      /**< Mode enable for RAC_LNAMIXCAL               */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL2_DEFAULT                          (_RAC_LNAMIXCAL_LNAMIXENIRCAL2_DEFAULT << 3)      /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL2_disable                          (_RAC_LNAMIXCAL_LNAMIXENIRCAL2_disable << 3)      /**< Shifted mode disable for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL2_enable                           (_RAC_LNAMIXCAL_LNAMIXENIRCAL2_enable << 3)       /**< Shifted mode enable for RAC_LNAMIXCAL       */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_SHIFT                          4                                                 /**< Shift value for RAC_LNAMIXIRCAL1AMP         */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_MASK                           0x70UL                                            /**< Bit mask for RAC_LNAMIXIRCAL1AMP            */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_DEFAULT                        0x00000007UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_DEFAULT                         (_RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_DEFAULT << 4)     /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL2AMP_SHIFT                          7                                                 /**< Shift value for RAC_LNAMIXIRCAL2AMP         */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL2AMP_MASK                           0x380UL                                           /**< Bit mask for RAC_LNAMIXIRCAL2AMP            */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL2AMP_DEFAULT                        0x00000007UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define RAC_LNAMIXCAL_LNAMIXIRCAL2AMP_DEFAULT                         (_RAC_LNAMIXCAL_LNAMIXIRCAL2AMP_DEFAULT << 7)     /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */

/* Bit fields for RAC LNAMIXEN */
#define _RAC_LNAMIXEN_RESETVALUE                                      0x00000000UL                             /**< Default value for RAC_LNAMIXEN              */
#define _RAC_LNAMIXEN_MASK                                            0x00000001UL                             /**< Mask for RAC_LNAMIXEN                       */
#define RAC_LNAMIXEN_LNAMIXENLDO                                      (0x1UL << 0)                             /**< LNAMIXENLDO                                 */
#define _RAC_LNAMIXEN_LNAMIXENLDO_SHIFT                               0                                        /**< Shift value for RAC_LNAMIXENLDO             */
#define _RAC_LNAMIXEN_LNAMIXENLDO_MASK                                0x1UL                                    /**< Bit mask for RAC_LNAMIXENLDO                */
#define _RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT                             0x00000000UL                             /**< Mode DEFAULT for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENLDO_disable                             0x00000000UL                             /**< Mode disable for RAC_LNAMIXEN               */
#define _RAC_LNAMIXEN_LNAMIXENLDO_enable                              0x00000001UL                             /**< Mode enable for RAC_LNAMIXEN                */
#define RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT                              (_RAC_LNAMIXEN_LNAMIXENLDO_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENLDO_disable                              (_RAC_LNAMIXEN_LNAMIXENLDO_disable << 0) /**< Shifted mode disable for RAC_LNAMIXEN       */
#define RAC_LNAMIXEN_LNAMIXENLDO_enable                               (_RAC_LNAMIXEN_LNAMIXENLDO_enable << 0)  /**< Shifted mode enable for RAC_LNAMIXEN        */

