SiliconLabs/sdk_support/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_rac.h
#define RAC_PATRIM1_PATRIMDLY1_tdly_75ps                              (_RAC_PATRIM1_PATRIMDLY1_tdly_75ps << 25)                /**< Shifted mode tdly_75ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY1_tdly_83ps                              (_RAC_PATRIM1_PATRIMDLY1_tdly_83ps << 25)                /**< Shifted mode tdly_83ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMFBKATTPDRVLDO                               (0x1UL << 28)                                            /**< PATRIMFBKATTPDRVLDO                         */
#define _RAC_PATRIM1_PATRIMFBKATTPDRVLDO_SHIFT                        28                                                       /**< Shift value for RAC_PATRIMFBKATTPDRVLDO     */
#define _RAC_PATRIM1_PATRIMFBKATTPDRVLDO_MASK                         0x10000000UL                                             /**< Bit mask for RAC_PATRIMFBKATTPDRVLDO        */
#define _RAC_PATRIM1_PATRIMFBKATTPDRVLDO_DEFAULT                      0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIMFBKATTPDRVLDO_less_bw                      0x00000000UL                                             /**< Mode less_bw for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIMFBKATTPDRVLDO_more_bw                      0x00000001UL                                             /**< Mode more_bw for RAC_PATRIM1                */
#define RAC_PATRIM1_PATRIMFBKATTPDRVLDO_DEFAULT                       (_RAC_PATRIM1_PATRIMFBKATTPDRVLDO_DEFAULT << 28)         /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIMFBKATTPDRVLDO_less_bw                       (_RAC_PATRIM1_PATRIMFBKATTPDRVLDO_less_bw << 28)         /**< Shifted mode less_bw for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIMFBKATTPDRVLDO_more_bw                       (_RAC_PATRIM1_PATRIMFBKATTPDRVLDO_more_bw << 28)         /**< Shifted mode more_bw for RAC_PATRIM1        */
#define _RAC_PATRIM1_PATRIMIBIASMASTER_SHIFT                          29                                                       /**< Shift value for RAC_PATRIMIBIASMASTER       */
#define _RAC_PATRIM1_PATRIMIBIASMASTER_MASK                           0x60000000UL                                             /**< Bit mask for RAC_PATRIMIBIASMASTER          */
#define _RAC_PATRIM1_PATRIMIBIASMASTER_DEFAULT                        0x00000002UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_45u                   0x00000000UL                                             /**< Mode Ibias_is_45u for RAC_PATRIM1           */
#define _RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_47p5u                 0x00000001UL                                             /**< Mode Ibias_is_47p5u for RAC_PATRIM1         */
#define _RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_50u                   0x00000002UL                                             /**< Mode Ibias_is_50u for RAC_PATRIM1           */
#define _RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_52p5u                 0x00000003UL                                             /**< Mode Ibias_is_52p5u for RAC_PATRIM1         */
#define RAC_PATRIM1_PATRIMIBIASMASTER_DEFAULT                         (_RAC_PATRIM1_PATRIMIBIASMASTER_DEFAULT << 29)           /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_45u                    (_RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_45u << 29)      /**< Shifted mode Ibias_is_45u for RAC_PATRIM1   */
#define RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_47p5u                  (_RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_47p5u << 29)    /**< Shifted mode Ibias_is_47p5u for RAC_PATRIM1 */
#define RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_50u                    (_RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_50u << 29)      /**< Shifted mode Ibias_is_50u for RAC_PATRIM1   */
#define RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_52p5u                  (_RAC_PATRIM1_PATRIMIBIASMASTER_Ibias_is_52p5u << 29)    /**< Shifted mode Ibias_is_52p5u for RAC_PATRIM1 */

/* Bit fields for RAC PATRIM2 */
#define _RAC_PATRIM2_RESETVALUE                                       0x30C0F87AUL                                             /**< Default value for RAC_PATRIM2               */
#define _RAC_PATRIM2_MASK                                             0x7FFFFFFFUL                                             /**< Mask for RAC_PATRIM2                        */
#define _RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_SHIFT                       0                                                        /**< Shift value for RAC_PATRIMLDOFBHVPDRVLDO    */
#define _RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_MASK                        0x3UL                                                    /**< Bit mask for RAC_PATRIMLDOFBHVPDRVLDO       */
#define _RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_DEFAULT                     0x00000002UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p22                   0x00000000UL                                             /**< Mode vreg_1p22 for RAC_PATRIM2              */
#define _RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p28                   0x00000001UL                                             /**< Mode vreg_1p28 for RAC_PATRIM2              */
#define _RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p35                   0x00000002UL                                             /**< Mode vreg_1p35 for RAC_PATRIM2              */
#define _RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p44                   0x00000003UL                                             /**< Mode vreg_1p44 for RAC_PATRIM2              */
#define RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_DEFAULT                      (_RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p22                    (_RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p22 << 0)       /**< Shifted mode vreg_1p22 for RAC_PATRIM2      */
#define RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p28                    (_RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p28 << 0)       /**< Shifted mode vreg_1p28 for RAC_PATRIM2      */
#define RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p35                    (_RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p35 << 0)       /**< Shifted mode vreg_1p35 for RAC_PATRIM2      */
#define RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p44                    (_RAC_PATRIM2_PATRIMLDOFBHVPDRVLDO_vreg_1p44 << 0)       /**< Shifted mode vreg_1p44 for RAC_PATRIM2      */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_SHIFT                        2                                                        /**< Shift value for RAC_PATRIMLDOFBHVPREREG     */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_MASK                         0x1CUL                                                   /**< Bit mask for RAC_PATRIMLDOFBHVPREREG        */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_DEFAULT                      0x00000006UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p678                   0x00000000UL                                             /**< Mode vreg_1p678 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p735                   0x00000001UL                                             /**< Mode vreg_1p735 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p801                   0x00000002UL                                             /**< Mode vreg_1p801 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p875                   0x00000003UL                                             /**< Mode vreg_1p875 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p00                    0x00000004UL                                             /**< Mode vreg_3p00 for RAC_PATRIM2              */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p14                    0x00000005UL                                             /**< Mode vreg_3p14 for RAC_PATRIM2              */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p3                     0x00000006UL                                             /**< Mode vreg_3p3 for RAC_PATRIM2               */
#define _RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p477                   0x00000007UL                                             /**< Mode vreg_3p477 for RAC_PATRIM2             */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_DEFAULT                       (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_DEFAULT << 2)          /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p678                    (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p678 << 2)       /**< Shifted mode vreg_1p678 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p735                    (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p735 << 2)       /**< Shifted mode vreg_1p735 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p801                    (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p801 << 2)       /**< Shifted mode vreg_1p801 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p875                    (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_1p875 << 2)       /**< Shifted mode vreg_1p875 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p00                     (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p00 << 2)        /**< Shifted mode vreg_3p00 for RAC_PATRIM2      */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p14                     (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p14 << 2)        /**< Shifted mode vreg_3p14 for RAC_PATRIM2      */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p3                      (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p3 << 2)         /**< Shifted mode vreg_3p3 for RAC_PATRIM2       */
#define RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p477                    (_RAC_PATRIM2_PATRIMLDOFBHVPREREG_vreg_3p477 << 2)       /**< Shifted mode vreg_3p477 for RAC_PATRIM2     */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_SHIFT                         5                                                        /**< Shift value for RAC_PATRIMLDOHVPDRVLDO      */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_MASK                          0xE0UL                                                   /**< Bit mask for RAC_PATRIMLDOHVPDRVLDO         */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_DEFAULT                       0x00000003UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p675                    0x00000000UL                                             /**< Mode vref_0p675 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p700                    0x00000001UL                                             /**< Mode vref_0p700 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p725                    0x00000002UL                                             /**< Mode vref_0p725 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p750                    0x00000003UL                                             /**< Mode vref_0p750 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p775                    0x00000004UL                                             /**< Mode vref_0p775 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p800                    0x00000005UL                                             /**< Mode vref_0p800 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p825                    0x00000006UL                                             /**< Mode vref_0p825 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p850                    0x00000007UL                                             /**< Mode vref_0p850 for RAC_PATRIM2             */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_DEFAULT                        (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_DEFAULT << 5)           /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p675                     (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p675 << 5)        /**< Shifted mode vref_0p675 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p700                     (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p700 << 5)        /**< Shifted mode vref_0p700 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p725                     (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p725 << 5)        /**< Shifted mode vref_0p725 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p750                     (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p750 << 5)        /**< Shifted mode vref_0p750 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p775                     (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p775 << 5)        /**< Shifted mode vref_0p775 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p800                     (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p800 << 5)        /**< Shifted mode vref_0p800 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p825                     (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p825 << 5)        /**< Shifted mode vref_0p825 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p850                     (_RAC_PATRIM2_PATRIMLDOHVPDRVLDO_vref_0p850 << 5)        /**< Shifted mode vref_0p850 for RAC_PATRIM2     */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_SHIFT                          8                                                        /**< Shift value for RAC_PATRIMLDOHVPREREG       */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_MASK                           0xF00UL                                                  /**< Bit mask for RAC_PATRIMLDOHVPREREG          */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_DEFAULT                        0x00000008UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p651                     0x00000000UL                                             /**< Mode vref_0p651 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p663                     0x00000001UL                                             /**< Mode vref_0p663 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p676                     0x00000002UL                                             /**< Mode vref_0p676 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p688                     0x00000003UL                                             /**< Mode vref_0p688 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p701                     0x00000004UL                                             /**< Mode vref_0p701 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p713                     0x00000005UL                                             /**< Mode vref_0p713 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p726                     0x00000006UL                                             /**< Mode vref_0p726 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p738                     0x00000007UL                                             /**< Mode vref_0p738 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p751                     0x00000008UL                                             /**< Mode vref_0p751 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p763                     0x00000009UL                                             /**< Mode vref_0p763 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p776                     0x0000000AUL                                             /**< Mode vref_0p776 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p788                     0x0000000BUL                                             /**< Mode vref_0p788 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p801                     0x0000000CUL                                             /**< Mode vref_0p801 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p813                     0x0000000DUL                                             /**< Mode vref_0p813 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p826                     0x0000000EUL                                             /**< Mode vref_0p826 for RAC_PATRIM2             */
#define _RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p838                     0x0000000FUL                                             /**< Mode vref_0p838 for RAC_PATRIM2             */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_DEFAULT                         (_RAC_PATRIM2_PATRIMLDOHVPREREG_DEFAULT << 8)            /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p651                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p651 << 8)         /**< Shifted mode vref_0p651 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p663                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p663 << 8)         /**< Shifted mode vref_0p663 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p676                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p676 << 8)         /**< Shifted mode vref_0p676 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p688                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p688 << 8)         /**< Shifted mode vref_0p688 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p701                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p701 << 8)         /**< Shifted mode vref_0p701 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p713                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p713 << 8)         /**< Shifted mode vref_0p713 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p726                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p726 << 8)         /**< Shifted mode vref_0p726 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p738                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p738 << 8)         /**< Shifted mode vref_0p738 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p751                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p751 << 8)         /**< Shifted mode vref_0p751 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p763                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p763 << 8)         /**< Shifted mode vref_0p763 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p776                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p776 << 8)         /**< Shifted mode vref_0p776 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p788                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p788 << 8)         /**< Shifted mode vref_0p788 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p801                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p801 << 8)         /**< Shifted mode vref_0p801 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p813                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p813 << 8)         /**< Shifted mode vref_0p813 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p826                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p826 << 8)         /**< Shifted mode vref_0p826 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p838                      (_RAC_PATRIM2_PATRIMLDOHVPREREG_vref_0p838 << 8)         /**< Shifted mode vref_0p838 for RAC_PATRIM2     */
#define RAC_PATRIM2_PATRIMLDOPSRPDRVLDO                               (0x1UL << 12)                                            /**< PATRIMLDOPSRPDRVLDO                         */
#define _RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_SHIFT                        12                                                       /**< Shift value for RAC_PATRIMLDOPSRPDRVLDO     */
#define _RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_MASK                         0x1000UL                                                 /**< Bit mask for RAC_PATRIMLDOPSRPDRVLDO        */
#define _RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_DEFAULT                      0x00000001UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_low_psr                      0x00000000UL                                             /**< Mode low_psr for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_high_psr                     0x00000001UL                                             /**< Mode high_psr for RAC_PATRIM2               */
#define RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_DEFAULT                       (_RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_DEFAULT << 12)         /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_low_psr                       (_RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_low_psr << 12)         /**< Shifted mode low_psr for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_high_psr                      (_RAC_PATRIM2_PATRIMLDOPSRPDRVLDO_high_psr << 12)        /**< Shifted mode high_psr for RAC_PATRIM2       */
#define RAC_PATRIM2_PATRIMLDOPSRPREREG                                (0x1UL << 13)                                            /**< PATRIMLDOPSRPREREG                          */
#define _RAC_PATRIM2_PATRIMLDOPSRPREREG_SHIFT                         13                                                       /**< Shift value for RAC_PATRIMLDOPSRPREREG      */
#define _RAC_PATRIM2_PATRIMLDOPSRPREREG_MASK                          0x2000UL                                                 /**< Bit mask for RAC_PATRIMLDOPSRPREREG         */
#define _RAC_PATRIM2_PATRIMLDOPSRPREREG_DEFAULT                       0x00000001UL                                             /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOPSRPREREG_low_psr                       0x00000000UL                                             /**< Mode low_psr for RAC_PATRIM2                */
#define _RAC_PATRIM2_PATRIMLDOPSRPREREG_high_psr                      0x00000001UL                                             /**< Mode high_psr for RAC_PATRIM2               */
#define RAC_PATRIM2_PATRIMLDOPSRPREREG_DEFAULT                        (_RAC_PATRIM2_PATRIMLDOPSRPREREG_DEFAULT << 13)          /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOPSRPREREG_low_psr                        (_RAC_PATRIM2_PATRIMLDOPSRPREREG_low_psr << 13)          /**< Shifted mode low_psr for RAC_PATRIM2        */
#define RAC_PATRIM2_PATRIMLDOPSRPREREG_high_psr                       (_RAC_PATRIM2_PATRIMLDOPSRPREREG_high_psr << 13)         /**< Shifted mode high_psr for RAC_PATRIM2       */
#define _RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_SHIFT                     14                                                       /**< Shift value for RAC_PATRIMLDOSLICESPDRVLDO  */
#define _RAC_PATRIM2_PATRIMLDOSLICESPDRVLDO_MASK                      0xC000UL                                                 /**< Bit mask for RAC_PATRIMLDOSLICESPDRVLDO     */
